Revit 2027 API
Generic.GenericDiffuseImageFade Property
 The property labeled "Image Fade" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericDiffuseImageFade { get; }
Public Shared ReadOnly Property GenericDiffuseImageFade As String
	Get
public:
static property String^ GenericDiffuseImageFade {
	String^ get ();
}
static member GenericDiffuseImageFade : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace